Lesson-4-Methods/Practice-Problems-2.org
#+title: Lesson 4 Additional Practice Problems
#+property: header-args:ruby :session ruby :results output pp :wrap example :exports both
#+options: num:nil toc:nil
#+setupfile: http://10.1.1.1:3000/grumpybear/org-themes/raw/branch/master/src/solarized_dark/solarized_dark.theme


* Practice Problem 1
** Question:
Given the array below
#+begin_src ruby :results none
flintstones = ["Fred", "Barney", "Wilma", "Betty", "Pebbles", "BamBam"]
#+end_src

Turn this array into a hash where the names are the keys and the values are the positions in the array.
** Answer:
We have a few options. We need a way to keep track of both the array value and its position in the array, obviously. We can use ~Array#each_with_index~ instead of using an integer counter to loop through each index of the array. If we want to make this a one-liner, we can compose multiple functions. Iterate over all the indices of ~flintstones~ with ~Array#each_with_object~ and output a hash.

#+begin_src ruby :results value
(0..flintstones.count-1).each_with_object({}) { |index, out| out[flintstones[index]] = index }
#+end_src

#+RESULTS:
#+begin_example
{"Fred"=>0, "Barney"=>1, "Wilma"=>2, "Betty"=>3, "Pebbles"=>4, "BamBam"=>5}
#+end_example

* Practice Problem 2
** Question:
Add up all of the ages from the Munster family hash:
#+begin_src ruby :results none
ages = { "Herman" => 32, "Lily" => 30, "Grandpa" => 5843, "Eddie" => 10, "Marilyn" => 22, "Spot" => 237 }
#+end_src

** Answer:
#+begin_src ruby :results value
ages.values.sum
#+end_src

#+RESULTS:
#+begin_example
6174
#+end_example

* Practice Problem 3
** Question:
In the age hash:
#+begin_src ruby :results none
ages = { "Herman" => 32, "Lily" => 30, "Grandpa" => 402, "Eddie" => 10 }
#+end_src
remove people with age 100 and greater.
** Answer:
#+begin_src ruby :results value
ages.select { |k, v| v < 100 }
#+end_src

#+RESULTS:
#+begin_example
{"Herman"=>32, "Lily"=>30, "Eddie"=>10}
#+end_example

* Practice Problem 4
** Question:
Pick out the minimum age from our current Munster family hash:
#+begin_src ruby :results none
ages = { "Herman" => 32, "Lily" => 30, "Grandpa" => 5843, "Eddie" => 10, "Marilyn" => 22, "Spot" => 237 }
#+end_src
** Answer:
Simply, though maybe not most efficiently, we can obtain an array of all values of ~ages~ and sort it with ~Array#sort~. By default it sorts from lowest to highest. Naturally the minimum age present will be at index 0.
#+begin_src ruby :results value
ages.values.sort.first
#+end_src

#+RESULTS:
#+begin_example
10
#+end_example

* Practice Problem 5
** Question:
In the array:
#+begin_src ruby :results none
flintstones = %w(Fred Barney Wilma Betty BamBam Pebbles)
#+end_src
Find the index of the first name that starts with "Be"
** Answer:
#+begin_src ruby :results value
flintstones.index { |name| name[0..1] == "Be" }
#+end_src

#+RESULTS:
#+begin_example
3
#+end_example

* Practice Problem 6
** Question:
Amend this array so that the names are all shortened to just the first three characters:
#+begin_src ruby :results none
flintstones = %w(Fred Barney Wilma Betty BamBam Pebbles)
#+end_src
** Answer:
#+begin_src ruby :results value
flintstones.map { |name| name[0, 3] }
#+end_src

#+RESULTS:
#+begin_example
["Fre", "Bar", "Wil", "Bet", "Bam", "Peb"]
#+end_example

* Practice Problem 7
** Question:
Create a hash that expresses the frequency with which each letter occurs in this string:
#+begin_src ruby :results none
statement = "The Flintstones Rock"
#+end_src
ex:
#+begin_src ruby :results none
{ "F"=>1, "R"=>1, "T"=>1, "c"=>1, "e"=>2, ... }
#+end_src
