Lesson-4-Methods/Practice-Problems-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-21 Fri 18:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 4 Additional Practice Problems</title>
<meta name="author" content="Brady Stanton" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 4 Additional Practice Problems</h1>


<div id="outline-container-org09fe893" class="outline-2">
<h2 id="org09fe893">Practice Problem 1</h2>
<div class="outline-text-2" id="text-org09fe893">
</div>
<div id="outline-container-orgc48ed38" class="outline-3">
<h3 id="orgc48ed38">Question:</h3>
<div class="outline-text-3" id="text-orgc48ed38">
<p>
Given the array below
</p>
<div class="org-src-container">
<pre class="src src-ruby">flintstones = [<span style="color: #2aa198;">"Fred"</span>, <span style="color: #2aa198;">"Barney"</span>, <span style="color: #2aa198;">"Wilma"</span>, <span style="color: #2aa198;">"Betty"</span>, <span style="color: #2aa198;">"Pebbles"</span>, <span style="color: #2aa198;">"BamBam"</span>]
</pre>
</div>

<p>
Turn this array into a hash where the names are the keys and the values are the positions in the array.
</p>
</div>
</div>
<div id="outline-container-org266ebd7" class="outline-3">
<h3 id="org266ebd7">Answer:</h3>
<div class="outline-text-3" id="text-org266ebd7">
<p>
We have a few options. We need a way to keep track of both the array value and its position in the array, obviously. We can use <code>Array#each_with_index</code> instead of using an integer counter to loop through each index of the array. If we want to make this a one-liner, we can compose multiple functions. Iterate over all the indices of <code>flintstones</code> with <code>Array#each_with_object</code> and output a hash.
</p>

<div class="org-src-container">
<pre class="src src-ruby">(<span style="color: #d33682; font-weight: bold;">0</span>..flintstones.count-<span style="color: #d33682; font-weight: bold;">1</span>).each_with_object({}) { |index, out| out[flintstones[index]] = index }
</pre>
</div>

<pre class="example" id="org46f4c95">
{"Fred"=&gt;0, "Barney"=&gt;1, "Wilma"=&gt;2, "Betty"=&gt;3, "Pebbles"=&gt;4, "BamBam"=&gt;5}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba0a0e1" class="outline-2">
<h2 id="orgba0a0e1">Practice Problem 2</h2>
<div class="outline-text-2" id="text-orgba0a0e1">
</div>
<div id="outline-container-orgcb70b54" class="outline-3">
<h3 id="orgcb70b54">Question:</h3>
<div class="outline-text-3" id="text-orgcb70b54">
<p>
Add up all of the ages from the Munster family hash:
</p>
<div class="org-src-container">
<pre class="src src-ruby">ages = { <span style="color: #2aa198;">"Herman"</span> =&gt; <span style="color: #d33682; font-weight: bold;">32</span>, <span style="color: #2aa198;">"Lily"</span> =&gt; <span style="color: #d33682; font-weight: bold;">30</span>, <span style="color: #2aa198;">"Grandpa"</span> =&gt; <span style="color: #d33682; font-weight: bold;">5843</span>, <span style="color: #2aa198;">"Eddie"</span> =&gt; <span style="color: #d33682; font-weight: bold;">10</span>, <span style="color: #2aa198;">"Marilyn"</span> =&gt; <span style="color: #d33682; font-weight: bold;">22</span>, <span style="color: #2aa198;">"Spot"</span> =&gt; <span style="color: #d33682; font-weight: bold;">237</span> }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8b81b4" class="outline-3">
<h3 id="orgf8b81b4">Answer:</h3>
<div class="outline-text-3" id="text-orgf8b81b4">
<div class="org-src-container">
<pre class="src src-ruby">ages.values.sum
</pre>
</div>

<pre class="example" id="org3ebf97e">
6174
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fb0b87" class="outline-2">
<h2 id="org2fb0b87">Practice Problem 3</h2>
<div class="outline-text-2" id="text-org2fb0b87">
</div>
<div id="outline-container-org342d64c" class="outline-3">
<h3 id="org342d64c">Question:</h3>
<div class="outline-text-3" id="text-org342d64c">
<p>
In the age hash:
</p>
<div class="org-src-container">
<pre class="src src-ruby">ages = { <span style="color: #2aa198;">"Herman"</span> =&gt; <span style="color: #d33682; font-weight: bold;">32</span>, <span style="color: #2aa198;">"Lily"</span> =&gt; <span style="color: #d33682; font-weight: bold;">30</span>, <span style="color: #2aa198;">"Grandpa"</span> =&gt; <span style="color: #d33682; font-weight: bold;">402</span>, <span style="color: #2aa198;">"Eddie"</span> =&gt; <span style="color: #d33682; font-weight: bold;">10</span> }
</pre>
</div>
<p>
remove people with age 100 and greater.
</p>
</div>
</div>
<div id="outline-container-org0339512" class="outline-3">
<h3 id="org0339512">Answer:</h3>
<div class="outline-text-3" id="text-org0339512">
<div class="org-src-container">
<pre class="src src-ruby">ages.select { |k, v| v &lt; <span style="color: #d33682; font-weight: bold;">100</span> }
</pre>
</div>

<pre class="example" id="org4da2be5">
{"Herman"=&gt;32, "Lily"=&gt;30, "Eddie"=&gt;10}
</pre>
</div>
</div>
</div>

<div id="outline-container-org306fe4e" class="outline-2">
<h2 id="org306fe4e">Practice Problem 4</h2>
<div class="outline-text-2" id="text-org306fe4e">
</div>
<div id="outline-container-orgd815cca" class="outline-3">
<h3 id="orgd815cca">Question:</h3>
<div class="outline-text-3" id="text-orgd815cca">
<p>
Pick out the minimum age from our current Munster family hash:
</p>
<div class="org-src-container">
<pre class="src src-ruby">ages = { <span style="color: #2aa198;">"Herman"</span> =&gt; <span style="color: #d33682; font-weight: bold;">32</span>, <span style="color: #2aa198;">"Lily"</span> =&gt; <span style="color: #d33682; font-weight: bold;">30</span>, <span style="color: #2aa198;">"Grandpa"</span> =&gt; <span style="color: #d33682; font-weight: bold;">5843</span>, <span style="color: #2aa198;">"Eddie"</span> =&gt; <span style="color: #d33682; font-weight: bold;">10</span>, <span style="color: #2aa198;">"Marilyn"</span> =&gt; <span style="color: #d33682; font-weight: bold;">22</span>, <span style="color: #2aa198;">"Spot"</span> =&gt; <span style="color: #d33682; font-weight: bold;">237</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-org3ebf2c8" class="outline-3">
<h3 id="org3ebf2c8">Answer:</h3>
<div class="outline-text-3" id="text-org3ebf2c8">
<p>
Simply, though maybe not most efficiently, we can obtain an array of all values of <code>ages</code> and sort it with <code>Array#sort</code>. By default it sorts from lowest to highest. Naturally the minimum age present will be at index 0.
</p>
<div class="org-src-container">
<pre class="src src-ruby">ages.values.sort.first
</pre>
</div>

<pre class="example" id="orgd38469f">
10
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd572ed" class="outline-2">
<h2 id="orgfd572ed">Practice Problem 5</h2>
<div class="outline-text-2" id="text-orgfd572ed">
</div>
<div id="outline-container-org5dfbe5f" class="outline-3">
<h3 id="org5dfbe5f">Question:</h3>
<div class="outline-text-3" id="text-org5dfbe5f">
<p>
In the array:
</p>
<div class="org-src-container">
<pre class="src src-ruby">flintstones = <span style="color: #2aa198;">%w(Fred Barney Wilma Betty BamBam Pebbles)</span>
</pre>
</div>
<p>
Find the index of the first name that starts with &ldquo;Be&rdquo;
</p>
</div>
</div>
<div id="outline-container-org9bd258c" class="outline-3">
<h3 id="org9bd258c">Answer:</h3>
<div class="outline-text-3" id="text-org9bd258c">
<div class="org-src-container">
<pre class="src src-ruby">flintstones.index { |name| name[<span style="color: #d33682; font-weight: bold;">0</span>..<span style="color: #d33682; font-weight: bold;">1</span>] == <span style="color: #2aa198;">"Be"</span> }
</pre>
</div>

<pre class="example" id="orga966489">
3
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f78948" class="outline-2">
<h2 id="org9f78948">Practice Problem 6</h2>
<div class="outline-text-2" id="text-org9f78948">
</div>
<div id="outline-container-org6140515" class="outline-3">
<h3 id="org6140515">Question:</h3>
<div class="outline-text-3" id="text-org6140515">
<p>
Amend this array so that the names are all shortened to just the first three characters:
</p>
<div class="org-src-container">
<pre class="src src-ruby">flintstones = <span style="color: #2aa198;">%w(Fred Barney Wilma Betty BamBam Pebbles)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org71532e6" class="outline-3">
<h3 id="org71532e6">Answer:</h3>
<div class="outline-text-3" id="text-org71532e6">
<div class="org-src-container">
<pre class="src src-ruby">flintstones.map { |name| name[<span style="color: #d33682; font-weight: bold;">0</span>, <span style="color: #d33682; font-weight: bold;">3</span>] }
</pre>
</div>

<pre class="example" id="orgb142be0">
["Fre", "Bar", "Wil", "Bet", "Bam", "Peb"]
</pre>
</div>
</div>
</div>

<div id="outline-container-org0261ed1" class="outline-2">
<h2 id="org0261ed1">Practice Problem 7</h2>
<div class="outline-text-2" id="text-org0261ed1">
</div>
<div id="outline-container-org17d3bf8" class="outline-3">
<h3 id="org17d3bf8">Question:</h3>
<div class="outline-text-3" id="text-org17d3bf8">
<p>
Create a hash that expresses the frequency with which each letter occurs in this string:
</p>
<div class="org-src-container">
<pre class="src src-ruby">statement = <span style="color: #2aa198;">"The Flintstones Rock"</span>
</pre>
</div>
<p>
ex:
</p>
<div class="org-src-container">
<pre class="src src-ruby">{ <span style="color: #2aa198;">"F"</span>=&gt;<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #2aa198;">"R"</span>=&gt;<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #2aa198;">"T"</span>=&gt;<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #2aa198;">"c"</span>=&gt;<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #2aa198;">"e"</span>=&gt;<span style="color: #d33682; font-weight: bold;">2</span>, ... }
</pre>
</div>
</div>
</div>
