Lesson-4-Methods/Practice-Problems-2.html
<div id="outline-container-orgdbb587a" class="outline-3">
<h3 id="orgdbb587a">Answer:</h3>
<div class="outline-text-3" id="text-orgdbb587a">
<div class="org-src-container">
<pre class="src src-ruby">statement.chars.each_with_object({}) {|char, out| out[char] = (out[char] == <span style="color: #d33682; font-weight: bold;">nil</span> ? <span style="color: #d33682; font-weight: bold;">1</span> : out[char] + <span style="color: #d33682; font-weight: bold;">1</span>)}
</pre>
</div>

<pre class="example" id="orgb8385fc">
{"T"=&gt;1, "h"=&gt;1, "e"=&gt;2, " "=&gt;2, "F"=&gt;1, "l"=&gt;1, "i"=&gt;1, "n"=&gt;2, "t"=&gt;2, "s"=&gt;2, "o"=&gt;2, "R"=&gt;1, "c"=&gt;1, "k"=&gt;1}
</pre>

<p>
More readable:
</p>
<div class="org-src-container">
<pre class="src src-ruby">statement.chars.each_with_object({}) <span style="color: #859900; font-weight: bold;">do</span> |char, out|
  <span style="color: #859900; font-weight: bold;">if</span> out[char] == <span style="color: #d33682; font-weight: bold;">nil</span>
    out[char] = <span style="color: #d33682; font-weight: bold;">1</span>
  <span style="color: #859900; font-weight: bold;">else</span>
    out[char] += <span style="color: #d33682; font-weight: bold;">1</span>
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org0422bfa">
{"T"=&gt;1, "h"=&gt;1, "e"=&gt;2, " "=&gt;2, "F"=&gt;1, "l"=&gt;1, "i"=&gt;1, "n"=&gt;2, "t"=&gt;2, "s"=&gt;2, "o"=&gt;2, "R"=&gt;1, "c"=&gt;1, "k"=&gt;1}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4495315" class="outline-2">
<h2 id="org4495315">Practice Problem 8</h2>
<div class="outline-text-2" id="text-org4495315">
</div>
<div id="outline-container-orge51d7a0" class="outline-3">
<h3 id="orge51d7a0">Question:</h3>
<div class="outline-text-3" id="text-orge51d7a0">
<p>
What happens when we modify an array while we are iterating over it? What would be output by this code?
</p>
<div class="org-src-container">
<pre class="src src-ruby">numbers = [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>, <span style="color: #d33682; font-weight: bold;">4</span>]
numbers.each <span style="color: #859900; font-weight: bold;">do</span> |number|
  <span style="color: #268bd2;">p</span> number
  numbers.shift(<span style="color: #d33682; font-weight: bold;">1</span>)
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org522b981">
[3, 4]
</pre>

<p>
What would be output by this code?
</p>
<div class="org-src-container">
<pre class="src src-ruby">numbers = [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>, <span style="color: #d33682; font-weight: bold;">4</span>]
numbers.each <span style="color: #859900; font-weight: bold;">do</span> |number|
  <span style="color: #268bd2;">p</span> number
  numbers.pop(<span style="color: #d33682; font-weight: bold;">1</span>)
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org435922e">
[1, 2]
</pre>
</div>
</div>

<div id="outline-container-org2ccb1d0" class="outline-3">
<h3 id="org2ccb1d0">Answer:</h3>
<div class="outline-text-3" id="text-org2ccb1d0">
<p>
For the first code snippet, I think the most likely flow will be:
</p>
<ol class="org-ol">
<li><code>number</code> is assigned to <code>numbers[0]</code>, which is the value <code>1</code></li>
<li><code>1</code> is printed</li>
<li><code>numbers</code> calls <code>Array#shift</code>, causing <code>numbers</code> to be mutated</li>
<li><code>number</code> is assigned to <code>numbers[1]</code>, which no longer points to <code>2</code>, but now to <code>3</code> since they shifted by one</li>
<li><code>3</code> is printed</li>
<li><code>Array#shift</code> again</li>
<li>Either <code>numbers[2]</code> returns a value of <code>nil</code>, or it returns an error.</li>
<li>If no error is raised, then returns the last 2 values, or <code>[3, 4]</code>.</li>
</ol>

<p>
For the second code snippet, this is what I think will happen:
</p>
<ol class="org-ol">
<li><code>number</code> is assigned to index <code>0</code>, which is value <code>1</code></li>
<li><code>1</code> is printed</li>
<li><code>numbers[3]</code> is eradicated via <code>Array#pop</code>, so <code>4</code> goes bye bye</li>
<li><code>number</code> is assigned to index <code>1</code>, which is value 2</li>
<li><code>2</code> is printed</li>
<li><code>numbers[2]</code> is eradicated same as above, so long number <code>3</code></li>
<li><code>number</code> is assigned to <code>numbers[2]</code>, which returns <code>nil</code></li>
<li><code>numbers</code> is returned, which by now is the value <code>[1, 2]</code></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org194227d" class="outline-2">
<h2 id="org194227d">Practice Problem 9</h2>
<div class="outline-text-2" id="text-org194227d">
</div>
<div id="outline-container-org7b39f15" class="outline-3">
<h3 id="org7b39f15">Question:</h3>
<div class="outline-text-3" id="text-org7b39f15">
<p>
As we have seen previously we can use some built-in string methods to change the case of a string. A notably missing method is something provided in Rails, but not in Ruby itself&#x2026;titleize. This method in Ruby on Rails creates a string that has each word capitalized as it would be in a title. For example, the string:
</p>
<div class="org-src-container">
<pre class="src src-ruby">words = <span style="color: #2aa198;">"the flintstones rock"</span>
</pre>
</div>
<p>
would be
</p>
<div class="org-src-container">
<pre class="src src-ruby">words = <span style="color: #2aa198;">"The Flintstones Rock"</span>
</pre>
</div>
<p>
Write your own version of the rails <code>titleize</code> implementation.
</p>
</div>
</div>
<div id="outline-container-org3cacd48" class="outline-3">
<h3 id="org3cacd48">Answer</h3>
<div class="outline-text-3" id="text-org3cacd48">
<div class="org-src-container">
<pre class="src src-ruby">words.split.map {|w| w[<span style="color: #d33682; font-weight: bold;">0</span>].upcase + w[<span style="color: #d33682; font-weight: bold;">1</span>..]}.join(<span style="color: #2aa198;">' '</span>)
</pre>
</div>

<pre class="example" id="org819eae6">
"The Flintstones Rock"
</pre>

<p>
An easier way from the official solution:
</p>
<div class="org-src-container">
<pre class="src src-ruby">words.split.map { |w| w.capitalize }.join(<span style="color: #2aa198;">' '</span>)
</pre>
</div>

<pre class="example" id="orgd91583d">
"The Flintstones Rock"
</pre>
</div>
</div>
</div>

<div id="outline-container-org82e64ca" class="outline-2">
<h2 id="org82e64ca">Practice Problem 10</h2>
<div class="outline-text-2" id="text-org82e64ca">
</div>
<div id="outline-container-org59ac097" class="outline-3">
<h3 id="org59ac097">Question:</h3>
<div class="outline-text-3" id="text-org59ac097">
<p>
Given the munsters hash below
</p>
<div class="org-src-container">
<pre class="src src-ruby">munsters = {
  <span style="color: #2aa198;">"Herman"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">32</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Lily"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">30</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"female"</span> },
  <span style="color: #2aa198;">"Grandpa"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">402</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Eddie"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">10</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Marilyn"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">23</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"female"</span>}
}
</pre>
</div>
<p>
Modify the hash such that each member of the Munster family has an additional &ldquo;age<sub>group</sub>&rdquo; key that has one of three values describing the age group the family member is in (kid, adult, or senior). Your solution should produce the hash below
</p>
<div class="org-src-container">
<pre class="src src-ruby">{ <span style="color: #2aa198;">"Herman"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">32</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span>, <span style="color: #2aa198;">"age_group"</span> =&gt; <span style="color: #2aa198;">"adult"</span> },
  <span style="color: #2aa198;">"Lily"</span> =&gt; {<span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">30</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"female"</span>, <span style="color: #2aa198;">"age_group"</span> =&gt; <span style="color: #2aa198;">"adult"</span> },
  <span style="color: #2aa198;">"Grandpa"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">402</span>, <span style="color: #2aa198;">"g ender"</span> =&gt; <span style="color: #2aa198;">"male"</span>, <span style="color: #2aa198;">"age_group"</span> =&gt; <span style="color: #2aa198;">"senior"</span> },
  <span style="color: #2aa198;">"Eddie"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">10</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span>, <span style="color: #2aa198;">"age_group"</span> =&gt; <span style="color: #2aa198;">"kid"</span> },
  <span style="color: #2aa198;">"Marilyn"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">23</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"female"</span>, <span style="color: #2aa198;">"age_group"</span> =&gt; <span style="color: #2aa198;">"adult"</span> } }
</pre>
</div>
<p>
Note: a kid is in the age range 0 - 17, an adult is in the range 18 - 64 and a senior is aged 65+.
</p>
</div>
</div>
