Lesson-4-Methods/Practice-Problems-2.org
** Answer:
#+begin_src ruby :results value
munsters.each_value do |name|
  if name["age"] < 18
    name["age_group"] = "kid"
  elsif name["age"] < 65
    name["age_group"] = "adult"
  else
    name["age_group"] = "senior"
  end
end
#+end_src

#+RESULTS:
#+begin_example
{"Herman"=>{"age"=>32, "gender"=>"male", "age_group"=>"adult"},
 "Lily"=>{"age"=>30, "gender"=>"female", "age_group"=>"adult"},
 "Grandpa"=>{"age"=>402, "gender"=>"male", "age_group"=>"senior"},
 "Eddie"=>{"age"=>10, "gender"=>"male", "age_group"=>"kid"},
 "Marilyn"=>{"age"=>23, "gender"=>"female", "age_group"=>"adult"}}
#+end_example

#+begin_src ruby :results value :hlines yes
munsters.each_value do |name|
  case name["age"]
    when 0..17
      name["age_group"] = "kid"
    when 18..64
      name["age_group"] = "adult"
    else # or when 65..-1
      name["age_group"] = "senior"
    end
end
#+end_src

#+RESULTS:
#+begin_example
{"Herman"=>{"age"=>32, "gender"=>"male", "age_group"=>"adult"},
 "Lily"=>{"age"=>30, "gender"=>"female", "age_group"=>"adult"},
 "Grandpa"=>{"age"=>402, "gender"=>"male", "age_group"=>"senior"},
 "Eddie"=>{"age"=>10, "gender"=>"male", "age_group"=>"kid"},
 "Marilyn"=>{"age"=>23, "gender"=>"female", "age_group"=>"adult"}}
#+end_example
